foodlog/app/controllers/archive_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entries = Entry.all.group_by(&:day)