foodlog/app/controllers/entries_controller.rb

  def index
    @entries = Entry.where('created_at >= ?',Date.today)
---
SELECT "entries".* FROM "entries" WHERE (created_at >= '2023-06-22')

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("meal_type", "calories", "proteins", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "Breakfast"], ["calories", 24], ["proteins", 50], ["carbohydrates", 20], ["fats", 5], ["created_at", "2023-06-21 08:24:14.200745"], ["updated_at", "2023-06-21 08:24:14.200745"]]