hr-mitra/app/controllers/employees_controller.rb

INSERT INTO "employees" ("first_name", "middle_name", "last_name", "personal_email", "city", "state", "country", "pincode", "address_line_1", "address_line_2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @employee = Employee.new(employee_params)
        if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "employees" SET "address_line_1" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["address_line_1", "Gulshan"], ["updated_at", "2023-07-05 15:59:36.763806"], ["id", 2]]
---
    def update
        @employee= Employee.find(params[:id]).update(employee_params)