hr-mitra/app/controllers/employees_controller.rb

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 3]]
---
    def destroy
        if @employee.destroy